Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/consumer_protection_organisations.html.txt.tmx
Source language: en
Languages: ga

source: There are a number of statutory and voluntary consumer bodies
ga: Tá roinnt comhlachtaí reachtúla agus deonacha tomhaltóirí ann in Éirinn

source: These bodies are there to inform you of your rights as a consumer and to help you enforce these rights
ga: Tá na comhlachtaí sin ann chun tú a chur ar an eolas faoi do chearta mar thomhaltóir agus chun cuidiú leat na cearta sin a chur i bhfeidhm

source: The following information describes the main organisations that can advise you of your rights as a consumer
ga: Tuairiscíonn an rannóg seo ar na príomh-eagrais a thugann comhairle do dhaoine faoina gcearta mar thomhaltóirí

source: Information is included on bodies that provide consumer services to purchasers of goods and services in Ireland and in other EU member states
ga: Tugtar faisnéis anseo ar chomhlachtaí a sholáthraíonn seirbhísí tomhaltóirí do cheannaitheoirí earraí agus seirbhísí in Éirinn agus i mballstáit eile den AE

source: There are also a number of other regulatory and representative bodies for specific businesses that have a role in protecting the consumer
ga: Tá roinnt comhlachtaí rialála agus ionadaíocha eile ann do ghnónna sonracha a mbíonn ról acu i gcosaint an tomhaltóra

source: These are described in the relevant areas throughout the consumer portal
ga: Tugtar tuairisc orthu seo sna codanna ábhartha den thairseach tomhaltóirí trí chéile

source: As every consumer case is different, it is useful to consult the appropriate organisation that may advise you on your rights and entitlements
ga: Ós éagsúil gach tomhaltóir ó chéile, bíonn sé áisiúil dá réir chun dul i gcomhairle leis an eagras iomchuí a d'fhéadfadh comhairle a thabhairt duit faoi do chearta agus do theidlíochtaí

source: If you have a consumer complaint you should always begin by contacting the supplier of the goods or the provider of the service first
ga: Má bhíonn gearán tomhaltóra agat ba chóir duit teagmháil a dhéanamh i gcónaí le soláthraí na n-earraí nó le soláthraí na seirbhíse ar dtús

source: Often, issues can be easily remedied by speaking to the retailer or the proprietor
ga: Is minic saincheisteanna a bheith socraithe trí labhairt leis an miondíoltóir nó leis an úinéir

source: If they cannot or will not help even after you have put your complaint in writing, you can contact the relevant body for information
ga: Mura féidir leis an miondíoltóir nó leis an soláthraí seirbhíse ná mura dtabharfaidh siad cúnamh duit fíú tar éis duit do ghearán a chur i scríbhinn, féadann tú teagmháil a dhéanamh leis an gcomhlacht ábhartha le haghaidh eolais

source: Depending on the value of the goods or service, you may eventually need to consider going to Courts (Small Claims Court) or to arbitration or mediation to seek a remedy
ga: B’fhéidir go dteastófaí uait faoi dheireadh thiar chun smaoineamh faoina dhul os comhair Chúirt na nÉileamh Beag nó chuig eadráin nó idirghabháil chun réiteach a lorg

source: In advance of taking any action you should ensure that you have the correct information
ga: Ba cheart duit cinntiú go bhfuil an t-eolas ceart agat sula dtugann tú faoi aon ghníomh

source: Any of the bodies listed in this section will advise you on your rights and what steps to take to claim redress
ga: Tabharfaidh ceann ar bith de na comhlachtaí a liostaítear sa rannóg seo comhairle duit faoi do chearta agus na céimeanna le tógáil chun sásamh a éileamh

source: Different consumer bodies have different responsibilities when it comes to consumer rights
ga: Bíonn freagrachtaí éagsúla ar chomhlachtaí éagsúla i dtaobh cearta tomhaltóirí de

source: The Competition and Consumer Protection Commission (CCPC) which replaced the National Consumer Agency, for example, deals with consumer complaints and policy at a national level
ga: Déileáileann an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí‚ a tháinig in ionad an Ghníomhaireacht Náisiúnta do Thomhaltóirí, mar shampla, le gearáin agus beartas tomhaltóirí ar leibhéal náisiúnta

source: The European Consumer Centre (ECC) Ireland deals with consumer complaints in a cross border context
ga: Déileáileann an Lárionad Eorpach do Thomhaltóirí le gearáin tomhaltóirí i gcomhthéacs trasteorann

source: The Competition and Consumer Protection Commission has responsibility to provide consumer information on financial services.The Central Bank of Ireland is responsible for the regulation of all financial services firms
ga: Tá Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí freagracht chun faisnéis a chur ar fáil do thomhaltóirí ar sheirbhísí airgeadais.Tá Banc Ceannais na hÉireann freagrach as rialáil gach cuideachta seirbhísí airgeadais

source: Competition and Consumer Protection Commission
ga: An Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: Under the Competition and Consumer Protection Act 2014, on 31 October the National Consumer Agency and the Competition Authority were replaced by the Competition and Consumer Protection Commission (CCPC)
ga: Faoin Acht um Iomaíocht agus Cosaint Tomhaltóirí 2014, tá an Coimisiún Iomaíochta agus Cosaint Tomhaltóirí (CCPC) in ionad an Ghníomhaireacht Náisiúnta do Thomhaltóirí agus an tÚdarás Iomaíochta

source: The Commission took over the functions of the two agencies and is responsible for delivering an integrated set of services to the consumer including:
ga: Ghlac an Coimisiún le feidhmeanna an dá ghníomhaireacht.. Tá an CCPC freagrach as sraith seirbhísí chomhtháite a chur ar fáil don tomhaltóir‚ lena n-áirítear an méid a leanas:

source: Consumer organisations do not charge for providing advice
ga: Ní ghearrann eagraíochtaí tomhaltóirí aon táille ar chomhairle a sholáthar

source: You can contact any of the organisations listed below by telephone, e-mail, or by letter
ga: Is féidir leat dul i dteagmháil le haon cheann de na heagrais a liostaítear thíos trí mheán teileafóin, ríomhphoist nó litreach

source: You should check whether you could visit them at their offices before you make the trip to see them
ga: Ba cheart duit seiceáil an féidir leat cuairt a thabhairt ar a n-oifigí sula dtaistealaíonn tú chucu

source: You can also check information on their website before contacting them
ga: Féadann tú an t-eolas ar a suíomh gréasáin a sheiceáil freisin sula ndéanann tú teagmháil leo

source: The Competition and Consumer Protection Commission is a statutory body, set up to be a advocate on behalf of consumers
ga: Comhlacht reachtúil is iad an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí, a bunaíodh le bheith mar abhcóide ar son tomhaltóirí

source: It also has a leading role in consumer information, research, education and awareness
ga: Ina theannta sin‚ tá acu feidhm cheannais i bhfaisnéis‚ taighde‚ oideachas agus feasacht tomhaltóirí

source: Opening Hours:- Lines open Monday - Friday 9am - 6pm
ga: Uaireanta Oscailte:- Línte oscailte Luan - Aoine 9rn - 6in

source: Consumers Association of Ireland
ga: Cumann Tomhaltóirí na hÉireann

source: The Consumers’ Association of Ireland is a voluntary body which aims to inform, represent and protect Irish consumers
ga: Is comhlacht deonach é Cumann Tomhaltóirí na hÉireann arb é a aidhm chun tomhaltóirí Éireannacha a chur ar an eolas, a chosaint agus chun feidhmiú ar a sonsa

source: It provides an advice and information service for consumers
ga: Cuireann sé seirbhís eolais agus comhairle ar fáil do thomhaltóirí

source: The Consumers' Association also campaigns for improved consumer legislation
ga: Téann Cumann na dTomhaltóirí i mbun feachtas freisin chun reachtaíocht fheabhsaithe a fháil do thomhaltóirí

source: Consumers' Association of Ireland
ga: Cumann Tomhaltóirí na hÉireann

source: The Advertising Standards Authority for Ireland
ga: An tÚdarás um Chaighdeáin Fhógraíochta

source: The Advertising Standards Authority This is a voluntary self-regulatory body of advertising practitioners, which deals with complaints about standards of advertising
ga: Is comhlacht deonach féin-rialaitheach de chleachtóirí fógraíochta é seo, a phléann le gearáin faoi chaighdeáin fhógraíochta

source: There are voluntary codes of standards and you may complain about breaches of those standards
ga: Tá ann do chóid deonacha caighdeán agus féadann tú gearán a dhéanamh faoi bhristeacha na gcaighdeán sin

source: These codes are on Advertising Standards and on Sales Promotion Practice
ga: Baineann na cóid seo le Caighdeáin Fhógraíochta agus le Cleachtas maidir le Cur chun Cinn Díolachán

source: Advertising Standards Authority for Ireland
ga: Údarás na gCaighdeán Fógraíochta d'Éirinn

source: Tel:+353 (0)1 613 7040
ga: Teil:+353 (0)1 613 7040

source: Fax:+353 (0)1 613 7043
ga: Facs:+353 (0)1 613 7043

source: The Central Bank of Ireland
ga: Banc Ceannais na hÉireann

source: The Central Bank of Ireland is responsible for the regulation of all financial services firms in Ireland since October 2010
ga: Tá an Bhainc Ceannais na hÉireann freagrach as comhlachtaí seirbhísí airgeadais uile a rialú ó Meán Fómhair 2010 i leith

source: The Central Bank has specific functions in relation to consumer protection and consumer rights
ga: Tá feidhmeanna sonracha ag an Bhainc Ceannais maidir le cosaint tomhaltóirí agus cearta tomhaltóirí

source: It supervises financial firms to make sure that they comply with legislation and codes of conduct
ga: Déanann sé maoirseacht ar chomhlachtaí airgeadais lena chinntiú go gcomhlíonann siad an reachtaíocht agus cóid iompair

source: The authority ensures financial institutions are solvent which gives consumers confidence that their deposits and investments are secure
ga: Cinntíonn an t-údarás go mbíonn institiúidí airgeadais sócmhainneach, rud a thugann misneach do thomhaltóirí go mbíonn a gcuid taiscí agus infheistíochtaí slán

source: Central Bank of Ireland
ga: Banc Ceannais na hÉireann

source: European Consumer Centre (ECC)
ga: Lárionad Eorpach na dTomhaltóirí (ECC)

source: ECC Ireland provides a free information and advice service on consumer rights in the EU
ga: Soláthraíonn EEC Éire seirbhís eolais agus comhairle shaor in aisce faoi chearta tomhaltóirí san AE

source: It is part of an EU wide network of consumer centres and it can help you to solve consumer disputes arising in other member states of the EU
ga: Is cuid é de líonra ar fud an AE de lárionaid tomhaltóirí agus féadann sé cuidiú leat chun díospóidí tomhaltóra a réiteach a thagann chun cinn i mballstáit eile de chuid an AE

source: It does this by trying to solve the dispute directly and, if this fails, by referring your case to an Alternative Dispute Resolution organisation in the other member state
ga: Déanann sé an méid sin trí iarracht a dhéanamh chun an díospóid a réiteach go díreach, agus má theipeann air sin, trí do chás-sa a tharchur chuig an Líonra Eorpach Seachbhreithiúnach (EEJ-Net)

source: The Competition and Consumer Protection Commission and the European Commission jointly finances the Centre
ga: Is iad Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí agus an Coimisiún Eorpach a chomhchistíonn an Lárionad
